{
  "backend/main.mo": "Main Motoko actor defining types (AstroPerson, CompatibilityResult, PlanetPosition, DailyPlanetaryReport, PanchangDay) and functions for saving/retrieving compatibility results, daily planetary reports, and panchang data with persistent storage using Maps and Lists.",
  "backend/migration.mo": "Migration module defining type aliases matching main actor types and a run function that preserves compatibilities and dailyReports data during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: Marathi translations for panchang terms, PanchangCard component creation, Panchang page route addition, and React Query hooks for panchang data fetching.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 18 frontend files covering routing, pages, components, hooks, utilities, translations, and styling for the Jyotish Vivah astrology application with Marathi localization.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for traditional Indian astrology aesthetic.",
  "frontend/index.html": "HTML entry point with Marathi language attribute, meta description in Marathi, and Google Fonts preconnect for Devanagari typography support.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for planetary dashboard, matchmaking, and panchang pages, wrapped in ThemeProvider and Layout with Toaster for notifications.",
  "frontend/src/components/BirthDetailsForm.tsx": "Reusable form component for collecting birth details (name, date, time, place) with Marathi labels, validation using utility functions, and error display.",
  "frontend/src/components/CompatibilityResults.tsx": "Component displaying compatibility calculation results with score badge, person details, detailed Guna Milan analysis, and favorable/unfavorable status with appropriate icons and styling.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with navigation (home, planetary dashboard, panchang, matchmaking), hero banner with image, and footer with social links. Includes responsive mobile menu using Sheet component and Marathi localization.",
  "frontend/src/components/PanchangCard.tsx": "Displays daily Panchang (Hindu calendar) information in a card grid layout showing Tithi, Nakshatra, Yoga, Karana, and astronomical timings (sunrise, sunset, moonrise, moonset) with Marathi translations and themed icons.",
  "frontend/src/components/PlanetCard.tsx": "Renders individual planet position information in a card showing planet name in Marathi, zodiac sign, degree position, and retrograde status badge if applicable.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing backend actor creation with Internet Identity authentication, automatically invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient lifecycle and identity state with configurable options.",
  "frontend/src/hooks/useMatchmaking.ts": "Hook for matchmaking functionality that wraps save compatibility mutation and recent compatibilities query with toast notifications for success/error feedback.",
  "frontend/src/hooks/usePanchangData.ts": "Hook that calculates current day number from epoch and fetches Panchang data for that day using the backend query.",
  "frontend/src/hooks/usePlanetaryData.ts": "Hook that fetches daily planetary report for today's date using ISO date string format.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data fetching (recent compatibilities, daily planetary report, Panchang data) and mutations (save compatibility) with automatic cache invalidation.",
  "frontend/src/i18n/marathi.ts": "Marathi language strings for the entire application including navigation, planetary positions, Panchang, matchmaking, forms, validation messages, errors, and success notifications.",
  "frontend/src/index.css": "Main stylesheet defining CSS custom properties for light/dark themes with astrology-themed color palette (saffron, gold, terracotta) using OKLCH color space, Tailwind directives, and Noto Sans Devanagari font import.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient, InternetIdentityProvider, and App wrapped in their respective providers.",
  "frontend/src/pages/MatchmakingPage.tsx": "Matchmaking page component with tabbed interface for entering two people's birth details, calculating Guna Milan compatibility scores (out of 36), and viewing compatibility history using custom hooks and Marathi localization.",
  "frontend/src/pages/PanchangPage.tsx": "Panchang (Hindu calendar) page displaying daily astrological data with loading skeletons, error handling, and Marathi text strings.",
  "frontend/src/pages/PlanetaryDashboard.tsx": "Dashboard page showing planetary positions for the current date with planet cards, formatted Marathi dates, loading states, and error handling.",
  "frontend/src/utils/marathiTranslations.ts": "Utility module providing translation functions and lookup maps for converting English astrological terms (planets, zodiac signs, tithis, nakshatras, yogas, karanas) to Marathi script.",
  "frontend/src/utils/validation.ts": "Form validation utilities providing required field and date validation functions with Marathi error messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color variables, astrology-themed colors, Noto Sans Devanagari font, custom shadows, and animation keyframes for accordion and sidebar components.",
  "project_state.json": "Project state tracking file for a Marathi-language astrology app targeting professional astrologers. Includes features for matchmaking (Kundali matching), daily planetary positions, panchang display, and traditional Indian astrology-themed UI design."
}